Revit 2026 API

# ReferenceWithContext Class

---

An object including a reference to a geometric object and related context, as instance transform etc.

SystemObject Autodesk.Revit.DBReferenceWithContext

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReferenceWithContext : IDisposable
```
```vb
Public Class ReferenceWithContext
	Implements IDisposable
```
```cpp
public ref class ReferenceWithContext : IDisposable
```
```fsharp
type ReferenceWithContext =
    class
        interface IDisposable
    end
```

The ReferenceWithContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Proximity | The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReferenceWithContext |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceTransform | Gets the transform of the instance. |
|  | GetReference | Gets the reference of the geometric object. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The ReferenceWithContext is used as the returned value from the method [!:Autodesk::Revit::DB::Document::FindReferencesWithContextByDirection], ReferenceIntersector.Find(XYZ, XYZ), or ReferenceIntersector.FindNearest(XYZ, XYZ). It includes a reference intersecting a line extended in a certain direction from an origin point and the context of the geometric object, as the transform and proximity.

#### Reference

Autodesk.Revit.DB Namespace